*** Performance numbers

A table can be a good way of displaying the data that we have and analyze the
values. Tables in Emacs can use ~calc~ syntax org ~elisp~ code to make the table
formulas.

#+CAPTION: Evaluation numbers
|------------------+--------------------+-------+----------------|
|            Truth |           Estimate | Error | Absolute error |
|------------------+--------------------+-------+----------------|
|                1 |                  2 |    -1 |              1 |
|                2 |                  1 |     1 |              1 |
|                3 |                  4 |    -1 |              1 |
|                4 |                  5 |    -1 |              1 |
|                5 |                  3 |     2 |              2 |
|                6 |                  7 |    -1 |              1 |
|                7 |                  8 |    -1 |              1 |
|                8 |                  9 |    -1 |              1 |
|                9 |                  7 |     2 |              2 |
|               10 |                  9 |     1 |              1 |
|               11 |                 11 |     0 |              0 |
|               12 |                 13 |    -1 |              1 |
|               13 |                 11 |     2 |              2 |
|               14 |                 15 |    -1 |              1 |
|               15 |                 13 |     2 |              2 |
|               16 |                 15 |     1 |              1 |
|               17 |                 17 |     0 |              0 |
|               18 |                 18 |     0 |              0 |
|               19 |                 19 |     0 |              0 |
|               20 |                 19 |     1 |              1 |
|------------------+--------------------+-------+----------------|
| Number of values |                 20 |       |                |
|       Mean error |                0.2 |       |                |
|             RMSE | 1.1832159566199232 |       |                |
|------------------+--------------------+-------+----------------|
#+TBLFM: @2$1..@21$1='(identity remote(est-truth-data, @@#$1))::@2$2..@21$2='(identity remote(est-truth-data, @@#$2))::@2$3..@21$3=$1-$2::@2$4..@21$4='(abs (- $1 $2));N::@22$2='(length (list @2$4..@21$4));N::@23$2='(org-sbe "mean" (error @2$3..@21$3))::@24$2='(org-sbe "rmse" (estimate @2$1..@21$1) (truth @2$2..@21$2))

In order to get the values from the other table I am using [[https://orgmode.org/manual/References.html#index-remote-references-352][remote references]]. To
refer to the values of the other table. The formulas that the table accepts
should either follow the ~calc~ syntax or ~elisp~.

~Ex20~
To calculate the mean value we can define a code block like this
#+NAME: mean
#+BEGIN_SRC elisp :var error=0 :exports none
(let ((num-values (length error)))
  (/ (seq-reduce '+ error 0.0) num-values))
#+END_SRC

And reference it in the table formula

~Ex21~
Any code block can of course be used, not only the ones of ~elisp~. This is
~python~ block which calculates the ~rmse~ value:
#+NAME: rmse
#+BEGIN_SRC python :var estimate=0 :var truth=0 :exports none
import numpy as np
error = np.asarray(estimate) - np.asarray(truth)
result = np.sqrt(np.mean(np.square(error)))
return result
#+END_SRC

